Using cuda
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Conv1DModel                              [256, 200, 1]             --
├─ModuleList: 1-9                        --                        (recursive)
│    └─Conv1d: 2-1                       [256, 512, 200]           983,552
├─GELU: 1-2                              [256, 512, 200]           --
├─ModuleList: 1-9                        --                        (recursive)
│    └─Conv1d: 2-2                       [256, 256, 200]           393,472
├─GELU: 1-4                              [256, 256, 200]           --
├─ModuleList: 1-9                        --                        (recursive)
│    └─Conv1d: 2-3                       [256, 128, 200]           98,432
├─GELU: 1-6                              [256, 128, 200]           --
├─ModuleList: 1-9                        --                        (recursive)
│    └─Conv1d: 2-4                       [256, 64, 200]            24,640
├─GELU: 1-8                              [256, 64, 200]            --
├─ModuleList: 1-9                        --                        (recursive)
│    └─Conv1d: 2-5                       [256, 1, 200]             193
│    └─Sigmoid: 2-6                      [256, 1, 200]             --
==========================================================================================
Total params: 1,500,289
Trainable params: 1,500,289
Non-trainable params: 0
Total mult-adds (G): 76.81
==========================================================================================
Input size (MB): 131.07
Forward/backward pass size (MB): 393.63
Params size (MB): 6.00
Estimated Total Size (MB): 530.70
==========================================================================================
