Using cuda
====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
Transformer                                        [512, 200, 1]             --
├─Linear: 1-1                                      [512, 200, 256]           164,096
├─Linear: 1-2                                      [512, 200, 256]           (recursive)
├─PositionalEncodingNLP: 1-3                       [512, 200, 256]           --
│    └─Dropout: 2-1                                [512, 200, 256]           --
├─PositionalEncodingNLP: 1-4                       [512, 200, 256]           --
│    └─Dropout: 2-2                                [512, 200, 256]           --
├─Transformer: 1-5                                 [512, 200, 256]           --
│    └─TransformerEncoder: 2-3                     [512, 200, 256]           --
│    │    └─ModuleList: 3-1                        --                        1,187,328
│    │    └─LayerNorm: 3-2                         [512, 200, 256]           512
│    └─MyIdentityDecoder: 2-4                      [512, 200, 256]           --
├─Sequential: 1-6                                  [512, 200, 1]             --
│    └─Linear: 2-5                                 [512, 200, 64]            16,448
│    └─Dropout: 2-6                                [512, 200, 64]            --
│    └─GELU: 2-7                                   [512, 200, 64]            --
│    └─Linear: 2-8                                 [512, 200, 16]            1,040
│    └─Dropout: 2-9                                [512, 200, 16]            --
│    └─GELU: 2-10                                  [512, 200, 16]            --
│    └─Linear: 2-11                                [512, 200, 1]             17
│    └─Sigmoid: 2-12                               [512, 200, 1]             --
====================================================================================================
Total params: 1,369,441
Trainable params: 1,369,441
Non-trainable params: 0
Total mult-adds (M): 177.26
====================================================================================================
Input size (MB): 524.29
Forward/backward pass size (MB): 695.50
Params size (MB): 0.73
Estimated Total Size (MB): 1220.52
====================================================================================================
